​১. বাইনারি: 100011 10001 01000 0000000000000100
​Opcode: 100011 (35) -> lw (Load Word) ইনস্ট্রাকশন [I-Type]।
​rs (Base Register): 10001 (17) -> $s1
​rt (Target Register): 01000 (8) -> $t0
​Immediate (Offset): 0000000000000100 (4)
​Assembly: lw $t0, 4($s1)

​২. বাইনারি: 001000 01000 01000 0000000000000101
​Opcode: 001000 (8) -> addi (Add Immediate) ইনস্ট্রাকশন [I-Type]।
​rs: 01000 (8) -> $t0
​rt: 01000 (8) -> $t0
​Immediate: 0000000000000101 (5)
​Assembly: addi $t0, $t0, 5

​৩. বাইনারি: 101011 10001 01000 0000000000001000
​Opcode: 101011 (43) -> sw (Store Word) ইনস্ট্রাকশন [I-Type]।
​rs (Base Register): 10001 (17) -> $s1
​rt (Source Register): 01000 (8) -> $t0
​Immediate (Offset): 0000000000001000 (8)
​Assembly: sw $t0, 8($s1)

lw   $t0, 4($s1)
addi $t0, $t0, 5
sw   $t0, 8($s1)
